Конфигурация/InformationRegisters/УсловияДоговоровОбщие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровОбщие</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантНачалаСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНачалаСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантДлиныСрока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыДлиныСрока</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыБрокерскогоОбслуживания</v8:Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АгентскийДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоДепозита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БрокерскогоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВедениеРеестраВладельцевИменныхЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеденияРеестра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоДепозитнымВкладам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГенСоглашениеПоКонверсионнымОперациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДДУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительногоУправления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорКуплиПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнениеПравил</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаНаПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммунальныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МировоеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОказанияАудиторскихУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оценки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаПроведениеИдентификации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручительства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбОтступном</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецДепозитарногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СпецРегистрационногоОбслуживания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаСвоемУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтроительствоНаЧужомУчастке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрудовойДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Цессии</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Catalogs/БанковскиеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>БанковскиеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБанковскогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыБанковскихСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУправленияДовереннымиСредствами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкДляРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДоговораМНО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКорреспондента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранзитныйПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорМНО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерФилиалаКредитнойОрганизации</Name>
					<Comment>Указывается для филиалов, </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЦессии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ДепозитарныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДепозитарныеСчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДепозитарныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Эмитенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодчиненныеРазделы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попекаемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Попечитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПопечения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзитный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетТипаС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровОбщие/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	КонтрольДатыЗакрытияБанковскихСчетов(Отказ);
	КонтрольДатыЗакрытияДепозитарныхСчетов(Отказ);
	
	Справочники.Договоры.КонтрольПериодаУсловийДопСоглашения(ЭтотОбъект, Отказ);
	
	УниверсальныеМеханизмы.ЗаполнитьОрганизациюИзВедущегоИзмерения(ЭтотОбъект, "Договор");
	
КонецПроцедуры

Процедура КонтрольДатыЗакрытияБанковскихСчетов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.Договор КАК Справочник.Договоры) КАК Договор,
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.ДатаРасторжения КАК ДАТА) КАК ДатаРасторжения
		|ПОМЕСТИТЬ _УсловияДоговоровОбщие
		|ИЗ
		|	&УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БанковскиеСчета.Ссылка КАК Ссылка,
		|	БанковскиеСчета.Представление КАК Представление
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчета КАК БанковскиеСчета
		|		ПО (БанковскиеСчета.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (БанковскиеСчета.ПометкаУдаления = ЛОЖЬ)
		|			И (БанковскиеСчета.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ БанковскиеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ВЫБОР
		|			КОГДА _УсловияДоговоровОбщие.Договор.Организация = &РЭМ
		|				ТОГДА НЕ _УсловияДоговоровОбщие.Договор.НомерДоговора В (&ИсключаемыеДоговорыРЭМ)
		|			КОГДА _УсловияДоговоровОбщие.Договор.Организация = &Траст
		|				ТОГДА НЕ _УсловияДоговоровОбщие.Договор.НомерДоговора В (&ИсключаемыеДоговорыТраст)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
	
	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоДепозита);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.БанковскогоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.КомплексногоОбслуживания);
	
	Запрос.УстановитьПараметр("ВидыДоговоров",			ВидыДоговоров);
	Запрос.УстановитьПараметр("УсловияДоговоровОбщие",	ЭтотОбъект.Выгрузить(, "Договор, ДатаРасторжения"));
	
	Запрос.УстановитьПараметр("РЭМ",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("Траст",	ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	
	ИсключаемыеДоговорыРЭМ		= СтрРазделить("М99-4785/2019,М46-4785/2015,Д12-4785/2013,М100-4785/2019,М101-4785/2019,М66-4785/2016,"
											+ "Д45-4785/2016,М61-4785/2016,Д41-4785/2016,М65-4785/2016,Д44-4785/2016,М23-4785/2015,"
											+ "Д11-4785/2013,М30-4785/2015,Д20-4785/2013,М113-4785/2020,Д65-4785/2020,М59-4785/2016,"
											+ "Д38-4785/2016,М58-4785/2016,Д39-4785/2016,М89-4785/2018,Д63-4785/2019,М32-4785/2015,"
											+ "Д11-0028/2012,М8-4785/2015,Д14-4785/2013,М22-4785/2015,Д3-4785/2013,Д46-4785/2016,"
											+ "М13-4785/2015,Д1-4785/2013,М15-4785/2015,Д19-4785/2013,М17-4785/2015,Д62-4785/2018,"
											+ "М126-4785/2021,М21-4785/2015,Д42-4785/2016,М104-4785/2019,М116-4785/2020,М95-4785/2018,"
											+ "М7-4785/2015,М115-4785/2020,М6-4785/2015,М120-4785/2021,М2-4785/2014,М121-4785/2021,"
											+ "М128-4785/2022,М130-4785/2022,М127-4785/2021,М5-4785/2015" , ",");
	
	ИсключаемыеДоговорыТраст	= СтрРазделить("М63-26128/2021,М61-26128/2021,М74-26128/2021,М35-26128/2019,М6-26128/2018,Д22-26128/2020,"
											+ "М31-26128/2019,М40-26128/2019,М65-26128/2021,М73-26128/2021,М18-26128/2018,М20-21054/2017,"
											+ "М14-21054/2017,Д16-26128/2020,М21-21054/2017,Д18-26128/2020,М22-21054/2017,М41-26128/2019,"
											+ "М75-26128/2021,М20-26128/2018,Д12-26128/2019,М39-26128/2019,М38-26128/2019,М47-26128/2019,"
											+ "Д19-26128/2020,М3-21054/2015,Д11-21054/2017,М48-26128/2019,Д15-26128/2020,М37-26128/2019,"
											+ "М8-21054/2015,Д6-21054/2015,М42-26128/2019,М78-26128/2021,М44-26128/2019,М1-21054/2013", ",");
	
	Запрос.УстановитьПараметр("ИсключаемыеДоговорыРЭМ",		ИсключаемыеДоговорыРЭМ);
	Запрос.УстановитьПараметр("ИсключаемыеДоговорыТраст",	ИсключаемыеДоговорыТраст);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата закрытия счета «" + Выборка.Представление + "» позже даты расторжения договора", Выборка.Ссылка, , , Отказ);
	КонецЦикла;
	
КонецПроцедуры

Процедура КонтрольДатыЗакрытияДепозитарныхСчетов(Отказ)

	ВидыДоговоров = Новый Массив;
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ОтветственногоХранения);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.ВеденияРеестра);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецДепозитарногоОбслуживания);
	ВидыДоговоров.Добавить(Перечисления.ВидыДоговоров.СпецРегистрационногоОбслуживания);

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.Договор КАК Справочник.Договоры) КАК Договор,
		|	ВЫРАЗИТЬ(УсловияДоговоровОбщие.ДатаРасторжения КАК ДАТА) КАК ДатаРасторжения
		|ПОМЕСТИТЬ _УсловияДоговоровОбщие
		|ИЗ
		|	&УсловияДоговоровОбщие КАК УсловияДоговоровОбщие
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	""счета"" КАК ВидЭлемента,
		|	ДепозитарныеСчета.Ссылка КАК Ссылка,
		|	ДепозитарныеСчета.Наименование КАК Представление
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДепозитарныеСчета КАК ДепозитарныеСчета
		|		ПО (ДепозитарныеСчета.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (ДепозитарныеСчета.ПометкаУдаления = ЛОЖЬ)
		|			И (ДепозитарныеСчета.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ ДепозитарныеСчета.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""исполнителей"",
		|	ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ИсполнителиПоЦеннымБумагам.СчетДоверительногоУправления)
		|ИЗ
		|	_УсловияДоговоровОбщие КАК _УсловияДоговоровОбщие
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИсполнителиПоЦеннымБумагам КАК ИсполнителиПоЦеннымБумагам
		|		ПО (ИсполнителиПоЦеннымБумагам.ДепозитарныйСчет.Договор = _УсловияДоговоровОбщие.Договор)
		|			И (ИсполнителиПоЦеннымБумагам.ДатаЗакрытия > _УсловияДоговоровОбщие.ДатаРасторжения
		|				ИЛИ ИсполнителиПоЦеннымБумагам.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1))
		|ГДЕ
		|	_УсловияДоговоровОбщие.Договор.ВидДоговора В(&ВидыДоговоров)
		|	И _УсловияДоговоровОбщие.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)";

	Запрос.УстановитьПараметр("ВидыДоговоров",          ВидыДоговоров);
	Запрос.УстановитьПараметр("УсловияДоговоровОбщие",  ЭтотОбъект.Выгрузить(, "Договор, ДатаРасторжения"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Дата закрытия " + Выборка.ВидЭлемента + " """ + Выборка.Представление + """ позже даты расторжения договора",
			Выборка.Ссылка, , , Отказ);
	КонецЦикла;

КонецПроцедуры
